Repository: EthanChartoff/FRC2230ScoutingApp
Catalog: lib/l10n/app_*.arb
Languages: he

source: VIEWER
he: צופה

source: SCOUTER
he: סקאוטר

source: STRATEGY
he: אסטרטגיה

# teamSearchTitle
source: Select a team to view its available data
he: בחר צוות כדי להציג את הנתונים הזמינים שלו

source: Scouter's Name
he: שם הסקאוטר

# wasRobotOnField
source: Was the robot on field?
he: האם הרובוט היה במִגרָשׁ?

# startingPos
source: Starting Position
he: מיקום התחלתי

source: Starting Item On Robot
he: פריט התחלתי ברובוט

# didRobotWorkInAuto
source: Did the robot work in auto?
he: האם הרובוט עבד באוטומטי?

source: Auto Charge Station Status
he: סטטוס חניה עמדת טעינה באוטומטי

# autoDidComeOutOfComunity
source: Did robot come out of community?
he: האם הרובוט יצא מהקהילה באוטומטי?

# autoTimeUntilBalancedOnChargeStation
source: Time Until Robot Balanced On Charge Station
he: זמן עד לאיזון על חניה העמדת טעינה באוטומטי

# didRobotWorkInTeleop
source: Did the robot work in teleop?
he: האם הרובוט עבד בטלאופ?

# teleopDidRobotDefend
source: Did the robot defend in teleop?
he: האם הרובוט הגן?

# teleopDidRobotGetDefended
source: Did the robot get defended in teleop?
he: האם הרובוט הוגן?

# teleopDidRobotFeed
source: Did the robot feed?
he: האם הרובוט עשה פיד?

source: Endgame Charge Station Status
he: סטטוס חניה עמדת טעינה בסוף המשחק

# endgameTimeUntilBalancedOnChargeStation
source: Time Until Robot Balanced On Charge Station
he: זמן עד לאיזון על חניה העמדת טעינה בסוף המשחק

# endgameFromWhichSide
source: From Which Side Did The Robot Drive To The Charge Station?
he: מאיזה צד הרובוט עלה לעמדת טעינה?

# endgameNumOfRobotsBeforeRobot
source: Number Of Robots Before Robot Drove To Charge Station
he: מספר רובוטים לפני שרובוט עלה לעמדת טעינה

# endgameNumOfRobotsAtEndOfMatch
source: Number Of Robots At The End Of The Match
he: מספר רובוטים על עמדת הטעינה בסוף המשחק

source: Defense Comments
he: הערות על ההגנה

source: Robot Comments
he: הערות על הרובוט

# exitButton
source: EXIT
he: יציאה

# saveButton
source: SAVE
he: שמירה

source: LOW
he: נמוך

source: MID
he: בינוני

source: HIGH
he: גבוה

source: CUBE
he: קוּבִּיָה

source: CONE
he: קוֹנוּס

source: NONE
he: כלום

source: COMMUNITY
he: קהילה

source: OUT
he: מִחוּץ לְ

# dataSavedMsg
source: Data has been saved
he: הנתונים נשמרו בהצלחה

source: No Data
he: אין נתונים זמינים

source: Worked
he: עבד

source: Out Of Community
he: יצא מהקהילה

source: On Charge Station
he: על עמדת טעינה

source: Scored
he: קלעו

source: Auto didn't work on charge station
he: באוטומטי לא עבד בעמדת טעינה

source: Charge Station Status
he: סטטוס חניה עמדת טעינה

source: Game Item On Start Of Game
he: פריט בהתחלת המשחק

# numOfSecsUntilBalancedOnChargeStation
source: Number Of Seconds Until Balanced On Charge Station
he: מספר שניות עד לאיזון על חניה עמדת טעינה

# numOfSecsBeforeTheEndRobotPivotedToChargeStation
source: Number Of Seconds Before The End Robot Pivoted To Charge Station
he: מספר שניות לפני סוף אוטומטי שהרובוט סע לעמדת טעינה

source: Did Defend
he: האם הגן?

source: Did Get Defended
he: האם הוגן?

source: Did Feed
he: האם עשה פיד?

# didPhaseWork
source: Did robot work in {phase}
he: {phase}האם הרובוט עבד ב

# rowItemByRound
source: {row} {gameItem} By Round
he: קלעו {gameItem} ל{row}

# attempedItemCounterTitle
source: Attempted to score {gameItem} on {row}
he: ניסה לקלוע {gameItem} ב-{row}

# scoredItemCounterTitle
source: {gameItem} Scored {row}
he: קלע {gameItem} ב-{row}

# gatheredIntoComunityCounterTitle
source: {gameItem} Gathered Into Comunity
he: איסף {gameItem} לקהילה

# getStrategyCategotyName
source: {category, select, gathering{Gathering} cargo{Cargo} scoring{Scoring} defenceOnOtherRobots{Defence On Other Robots} defenceOnThemselves{Defence On Themselves} drivers{Drivers} comments{Comments} other{}}
he: {category, select, gathering{איסוף} cargo{מטען}, scoring{ניקוד}, defenceOnOtherRobots{הגנה על רובוטים אחרים}, defenceOnThemselves{הגנה שעשו על עצמם} drivers{נהגים} comments{הערות} other{אחר}}

# getManuDetination
source: {destination, select, matches{matches} teams{teams} picklist{picklist} login{login} other{}}
he: {destination, select, matches{משחקים} teams{קבוצות} picklist{פיקליסט} login{התחברות} other{}}

# matchNumber
source: Match {matchNumber}
he: משחק {matchNumber}

# getMatchTypeFullName
source: {matchType, select, P{Practice} Q{Qualification} QF{Querter-Finals} SF{Semi-Finals} F{Finals} other{}}
he: {matchType, select, P{אימונים} Q{משחקי דירוג} QF{רבע גמר} SF{חצי גמר} F{גמר} other{}}

# picklistPageTitle
source: Pick {pickNumber}
he: פיק {pickNumber}
